apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpspi.c
#ifdef CONFIG_PM
static int up_pm_prepare(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  /* Logic to prepare for a reduced power state goes here. */

# ifdef CONFIG_PM_SPI0
  struct s32k1xx_lpspidev_s *priv0 = NULL;

  /* make the private struct for lpspi bus 0 */

  priv0 = &g_lpspi0dev;
#  endif
#  ifdef CONFIG_PM_SPI1
  struct s32k1xx_lpspidev_s *priv1 = NULL;

  /* make the private struct for lpspi bus 1  */

  priv1 = &g_lpspi1dev;
#  endif

  unsigned int count = 0;   /* the amount of peripheral clocks to change */

  peripheral_clock_source_t clock_source;

  /* check if the transition to the mode is already done */

  if (pm_querystate(PM_IDLE_DOMAIN) == pmstate)
    {
      /* return */

      return OK;
    }

  /* check which PM it is  */

  switch (pmstate)
  {
    /* in case it needs to prepare for VLPR mode */

    case PM_STANDBY:
    {
      /* Logic for PM_STANDBY goes here */

       /* set the right clock source */

      clock_source = CLK_SRC_SIRC_DIV2;

#  ifdef CONFIG_PM_SPI0_STANDBY

      /* increase count to change the SPI0  */

      count++;

#  endif
#  ifdef CONFIG_PM_SPI1_STANDBY

      /* increase count to change the SPI1 */

      count++;

#  endif
    }
    break;

    /* in case it needs to prepare for VLPR mode */

    case PM_SLEEP:
    {
      /* Logic for PM_STANDBY goes here */

      /* set the right clock source */

      clock_source = CLK_SRC_SIRC_DIV2;

#  ifdef CONFIG_PM_SPI0_SLEEP

      /* increase count to change the SPI0  */

      count++;

#  endif
#  ifdef CONFIG_PM_SPI1_SLEEP

      /* increase count to change the SPI1 */

      count++;

#  endif
    }
    break;

    default:
    {
      /* don't do anything, just return OK */
    }
    break;
  }

  /* check if you need to change something */

  if (count)
  {
    /* make the peripheral clock config struct */

    const struct peripheral_clock_config_s clock_config[] =
    {
#  ifdef CONFIG_PM_SPI0
      {
        .clkname  =   LPSPI0_CLK,
        .clkgate  =   true,
        .clksrc   =   clock_source,
        .frac     =   MULTIPLY_BY_ONE,
        .divider  =   1,
      },
#  endif
#  ifdef CONFIG_PM_SPI1
      {
        .clkname  =   LPSPI1_CLK,
        .clkgate  =   true,
        .clksrc   =   clock_source,
        .frac     =   MULTIPLY_BY_ONE,
        .divider  =   1,
      }
#  endif
    };

#  ifdef CONFIG_PM_SPI0

    /* disable LPSPI0 */

    s32k1xx_lpspi_modifyreg32(priv0, S32K1XX_LPSPI_CR_OFFSET, 0,
                                     !LPSPI_CR_MEN);

#  endif
#  ifdef CONFIG_PM_SPI1

    /* disable LPSPI1 */

    s32k1xx_lpspi_modifyreg32(priv1, S32K1XX_LPSPI_CR_OFFSET, 0,
                              !LPSPI_CR_MEN);

#  endif

    /* change the clock config for the new mode */

    s32k1xx_periphclocks(count, clock_config);

#  ifdef CONFIG_PM_SPI0

    /* Enable LPSPI */

    s32k1xx_lpspi_modifyreg32(priv0, S32K1XX_LPSPI_CR_OFFSET, 0,
                              LPSPI_CR_MEN);

#  endif
#  ifdef CONFIG_PM_SPI1

    /* Enable LPSPI */

    s32k1xx_lpspi_modifyreg32(priv1, S32K1XX_LPSPI_CR_OFFSET, 0,
                              LPSPI_CR_MEN);

#  endif
  }

  /* get the clock freq */

  /* return OK */

  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_lpspibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *s32k1xx_lpspibus_initialize(int bus)
{
  struct s32k1xx_lpspidev_s *priv = NULL;

  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_S32K1XX_LPSPI0
  if (bus == 0)
    {
      /* Select SPI0 */

      priv = &g_lpspi0dev;

      /* Only configure if the bus is not already configured */

      if ((s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CR_OFFSET) &
          LPSPI_CR_MEN) == 0)
        {
          /* Configure SPI0 pins: SCK, MISO, and MOSI */

          s32k1xx_pinconfig(PIN_LPSPI0_SCK);
          s32k1xx_pinconfig(PIN_LPSPI0_MISO);
          s32k1xx_pinconfig(PIN_LPSPI0_MOSI);

          /* Set up default configuration: Master, 8-bit, etc. */

          s32k1xx_lpspi_bus_initialize(priv);
        }
    }
  else
#endif
#ifdef CONFIG_S32K1XX_LPSPI1
  if (bus == 1)
    {
      #ifdef CONFIG_PM
        #if defined(CONFIG_PM_SPI_STANDBY) || defined(CONFIG_PM_SPI_SLEEP)
          int ret;

          /* Register to receive power management callbacks */

          ret = pm_register(&g_spi1_pmcb);
          DEBUGASSERT(ret == OK);
          UNUSED(ret);
        #endif
      #endif
      /* Select SPI1 */

      priv = &g_lpspi1dev;

      /* Only configure if the bus is not already configured */

      if ((s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CR_OFFSET) &
          LPSPI_CR_MEN) == 0)
        {
          /* Configure SPI1 pins: SCK, MISO, and MOSI */

          s32k1xx_pinconfig(PIN_LPSPI1_SCK);
          s32k1xx_pinconfig(PIN_LPSPI1_MISO);
          s32k1xx_pinconfig(PIN_LPSPI1_MOSI);

          /* Set up default configuration: Master, 8-bit, etc. */

          s32k1xx_lpspi_bus_initialize(priv);
        }
    }
  else
#endif
#ifdef CONFIG_S32K1XX_LPSPI2
  if (bus == 2)
    {
      /* Select SPI2 */

      priv = &g_lpspi2dev;

      /* Only configure if the bus is not already configured */

      if ((s32k1xx_lpspi_getreg32(priv, S32K1XX_LPSPI_CR_OFFSET) &
          LPSPI_CR_MEN) == 0)
        {
          /* Configure SPI2 pins: SCK, MISO, and MOSI */

          s32k1xx_pinconfig(PIN_LPSPI2_SCK);
          s32k1xx_pinconfig(PIN_LPSPI2_MISO);
          s32k1xx_pinconfig(PIN_LPSPI2_MOSI);

          /* Set up default configuration: Master, 8-bit, etc. */

          s32k1xx_lpspi_bus_initialize(priv);
        }
    }
  else
#endif
    {
      spierr("ERROR: Unsupported SPI bus: %d\n", bus);
    }

#ifdef CONFIG_S32K1XX_LPSPI_DMA
  /* Initialize the SPI semaphores that is used to wait for DMA completion.
   * This semaphore is used for signaling and, hence, should not have
   * priority inheritance enabled.
   */

  if (priv->rxch && priv->txch)
    {
      if (priv->txdma == NULL && priv->rxdma == NULL)
        {
          nxsem_init(&priv->rxsem, 0, 0);
          nxsem_init(&priv->txsem, 0, 0);

          priv->txdma = s32k1xx_dmach_alloc(priv->txch | DMAMUX_CHCFG_ENBL,
                                            0);
          priv->rxdma = s32k1xx_dmach_alloc(priv->rxch | DMAMUX_CHCFG_ENBL,
                                            0);
          DEBUGASSERT(priv->rxdma && priv->txdma);
        }
    }
  else
    {
      priv->rxdma = NULL;
      priv->txdma = NULL;
    }
#endif

  leave_critical_section(flags);

  return (struct spi_dev_s *)priv;
}

#endif /* CONFIG_S32K1XX_LPSPI0 || CONFIG_S32K1XX_LPSPI1 || CONFIG_S32K1XX_LPSPI2 */
